In [1]:
import pandas as pd

In [5]:
df=pd.read_excel(r'C:/Users/sagar/Sample.xls',sheet_name='Marks')
df

   ID           Subject  Marks Result
0   1              Math     90   Pass
1   1              Math     50   Pass
2   2  Computer Science     32   Fail
3   2  Computer Science     30   Fail
4   3              Math      0   Fail

In [6]:
df=pd.read_excel(r'C:/Users/sagar/Sample.xls',sheet_name=['Info','Marks'])
df

{'Info':    ID   Name  Age Country
 0   1    Joe   23   India
 1   1   John   19     USA
 2   2  James   38     USA
 3   2    Kim   15      UK
 4   3   Dani   20   India,
 'Marks':    ID           Subject  Marks Result
 0   1              Math     90   Pass
 1   1              Math     50   Pass
 2   2  Computer Science     32   Fail
 3   2  Computer Science     30   Fail
 4   3              Math      0   Fail}

In [9]:
df=pd.read_excel(r'C:/Users/sagar/Sample.xls',index_col=1)
df

       ID  Age Country
Name
Joe     1   23   India
John    1   19     USA
James   2   38     USA
Kim     2   15      UK
Dani    3   20   India

In [11]:
df=pd.read_excel(r'C:/Users/sagar/Sample.xls',index_col=0,names=['ID_New','Name_New','Age_New','Counrty_New'])
df

       Name_New  Age_New Counrty_New
ID_New
1           Joe       23       India
1          John       19         USA
2         James       38         USA
2           Kim       15          UK
3          Dani       20       India

In [12]:
df=pd.read_excel(r'C:/Users/sagar/Sample.xls',index_col=0,usecols='A:B')
df

     Name
ID
1     Joe
1    John
2   James
2     Kim
3    Dani

In [14]:

df.head(3)

     Name
ID
1     Joe
1    John
2   James

In [19]:
df=pd.read_excel(r'C:/Users/sagar/Sample.xls',index_col=0,usecols='A:E',names=['ID_New','Name_New','Age_New','Counrty_New','xyz_new'])
df

       Name_New  Age_New Counrty_New xyz_new
ID_New
1           Joe       23       India     NaN
1          John       19         USA     NaN
2         James       38         USA     NaN
2           Kim       15          UK     NaN
3          Dani       20       India     NaN

In [21]:
df=pd.read_excel(r'C:/Users/sagar/Sample.xls',index_col=0,skiprows=0)
df

     Name  Age Country
ID
1     Joe   23   India
1    John   19     USA
2   James   38     USA
2     Kim   15      UK
3    Dani   20   India